Revit 2024 API
FamilySymbolFilter Properties
The FamilySymbolFilter type exposes the following members.
Properties
Name | Description
FamilyId
 The family id.
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
FamilySymbolFilter Class
Autodesk.Revit.DB Namespace